Revit 2024 API
PDFExportOptions.PaperOrientation Property
 Paper orientation - Portrait/Landscape/Auto
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public PageOrientationType PaperOrientation { get; set; }
Visual Basic
Public Property PaperOrientation As PageOrientationType
	Get
	Set
Visual C++
public:
property PageOrientationType PaperOrientation {
	PageOrientationType get ();
	void set (PageOrientationType value);
}
Remarks
 Ignored when the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace